Revit 2027 API
BuiltInFailures.ElectricalFailures.MismatchVoltageToCircuit Property
 Cannot add [Element] to Circuit. The Voltage for [Element] is out of range for the Voltage ([Voltage Value]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchVoltageToCircuit { get; }
Public Shared ReadOnly Property MismatchVoltageToCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchVoltageToCircuit {
	FailureDefinitionId^ get ();
}
static member MismatchVoltageToCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace